# Homebrew bundle setup
tap "homebrew/bundle"

# System dependencies and core utilities
brew "mas"  # Required for Mac App Store installations
brew "openssl@3"
brew "readline"
brew "sqlite"
brew "xz"
brew "zlib"

# Shell and terminal utilities
brew "bat"
brew "direnv"
brew "fastfetch"
brew "fzf"
brew "htop"
brew "lsd"
brew "tree"
brew "zsh"
brew "fd"

# Development tools and languages
brew "gh"
brew "git"
brew "gnupg"
brew "go"
brew "hugo"
brew "jq"
brew "lazygit"
brew "neovim"
brew "nvm"
brew "pkgconf"

# Python development
brew "black"
brew "pipx"
brew "pyenv"
brew "ruff"

# System management and utilities
brew "chezmoi"
brew "cpufetch"
brew "ripgrep"
brew "shellcheck"
brew "sshs"

# GUI Applications
cask "appcleaner"
cask "cursor"
cask "discord"
cask "handbrake"
cask "imageoptim"
cask "iterm2"
cask "itsycal"
cask "keka"
cask "kekaexternalhelper"
cask "microsoft-edge"
cask "obsidian"
cask "orbstack"
cask "popclip"
cask "raycast"
cask "sf-symbols"
cask "stats"
cask "visual-studio-code"
cask "whatsapp"
cask "windsurf"

# Fonts
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"

# QuickLook plugins
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "suspicious-package"
cask "webpquicklook"

# Mac App Store applications
mas "Developer", id: 640199958
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835

# VS Code extensions
vscode "alefragnani.project-manager"
vscode "budparr.language-hugo-vscode"
vscode "charliermarsh.ruff"
vscode "cstrap.python-snippets"
vscode "davidanson.vscode-markdownlint"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "kevinrose.vsc-python-indent"
vscode "koalamer.workspace-in-status-bar"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "oderwat.indent-rainbow"
vscode "openai.openai-chatgpt-adhoc"
vscode "pkief.material-product-icons"
vscode "redhat.vscode-yaml"
vscode "rido3.wordcount"
vscode "rpinski.shebang-snippets"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "usernamehw.errorlens"
